# US - Baby Names

### Introduction:

We are going to use a subset of [US Baby Names](https://www.kaggle.com/kaggle/us-baby-names) from Kaggle.  
In the file it will be names from 2004 until 2014


### Step 1. Import the necessary libraries

In [1]:
import pandas as pd
import numpy as np
import re

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv).

### Step 3. Assign it to a variable called baby_names.

In [2]:
baby_names = pd.read_csv('https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv')

### Step 4. See the first 10 entries

In [3]:
baby_names.head(10)

   Unnamed: 0     Id      Name  Year Gender State  Count
0       11349  11350      Emma  2004      F    AK     62
1       11350  11351   Madison  2004      F    AK     48
2       11351  11352    Hannah  2004      F    AK     46
3       11352  11353     Grace  2004      F    AK     44
4       11353  11354     Emily  2004      F    AK     41
5       11354  11355   Abigail  2004      F    AK     37
6       11355  11356    Olivia  2004      F    AK     33
7       11356  11357  Isabella  2004      F    AK     30
8       11357  11358    Alyssa  2004      F    AK     29
9       11358  11359    Sophia  2004      F    AK     28

### Step 5. Delete the column 'Unnamed: 0' and 'Id'

In [4]:
baby_names.drop(['Unnamed: 0','Id'],axis = 1, inplace = True)

In [5]:
baby_names.head()

      Name  Year Gender State  Count
0     Emma  2004      F    AK     62
1  Madison  2004      F    AK     48
2   Hannah  2004      F    AK     46
3    Grace  2004      F    AK     44
4    Emily  2004      F    AK     41

### Step 6. Is there more male or female names in the dataset?

In [6]:
baby_names['Gender'].value_counts()

Gender
F    558846
M    457549
Name: count, dtype: int64

### Step 7. Group the dataset by name and assign to names

In [7]:
names = baby_names.groupby('Name')['Count'].sum().sort_values(ascending = False).reset_index()

In [8]:
names

             Name   Count
0           Jacob  242874
1            Emma  214852
2         Michael  214405
3           Ethan  209277
4        Isabella  204798
...           ...     ...
17627      Eniola       5
17628    Atlantis       5
17629       Marci       5
17630  Simarpreet       5
17631        Nita       5

[17632 rows x 2 columns]

### Step 8. How many different names exist in the dataset?

In [9]:
diff_names = baby_names['Name'].value_counts().reset_index()

In [10]:
diff_names

          Name  count
0        Riley   1112
1        Avery   1080
2       Jordan   1073
3       Peyton   1064
4       Hayden   1049
...        ...    ...
17627   Terryn      1
17628    Yanna      1
17629  Zemirah      1
17630  Emmilyn      1
17631  Coalton      1

[17632 rows x 2 columns]

In [11]:
len(diff_names)

17632

### Step 9. What is the name with most occurrences?

In [12]:
names[names['Count']==names['Count'].max()]['Name']

0    Jacob
Name: Name, dtype: object

### Step 10. How many different names have the least occurrences?

In [13]:
names.head()

       Name   Count
0     Jacob  242874
1      Emma  214852
2   Michael  214405
3     Ethan  209277
4  Isabella  204798

In [14]:
len(names[names['Count'] == names['Count'].min()]['Name'])

2578

### Step 11. What is the median name occurrence?

In [15]:
names[names['Count'] == names['Count'].median()].reset_index(drop = True)

        Name  Count
0    Zuleima     49
1       Vita     49
2      Aziah     49
3   Kaedence     49
4   Antonina     49
..       ...    ...
61  Mckynzie     49
62      Yoni     49
63    Hareem     49
64     Jkwon     49
65    Nazier     49

[66 rows x 2 columns]

### Step 12. What is the standard deviation of names?

In [16]:
names['Count'].std()

11006.0694678915

### Step 13. Get a summary with the mean, min, max, std and quartiles.

In [17]:
names.describe()

               Count
count   17632.000000
mean     2008.932169
std     11006.069468
min         5.000000
25%        11.000000
50%        49.000000
75%       337.000000
max    242874.000000